{
  "image": "assets/images/viana.webp",
  "title": "Viana do Castelo",
  "paragraphs": {
    "en": [
      "Viana do Castelo is a Portuguese city, capital of the district with the same name, in the Norte region, and integrated into the NUT III sub-region of Alto Minho, with about 26,000 inhabitants (2021).",
      "It is the seat of the municipality of Viana do Castelo, which has an area of 319.02 km² and 85,784 inhabitants (2021), subdivided into 27 parishes. The municipality is bordered to the north by the municipality of Caminha, to the east by Ponte de Lima, to the south by Barcelos and Esposende, and to the west by the Atlantic Ocean.",
      "The highest point in the municipality is located in the Serra de Arga, more precisely in Alto do Espinheiro, at an altitude of 825 m.",
      "It belongs to the Cittaslow Cities network.",
      "Until its elevation to city status on January 20, 1848, the current Viana do Castelo was simply called 'Viana' (also referred to as 'Viana da Foz do Lima' and 'Viana do Minho', to differentiate it from Viana do Alentejo). In 1977, it became the seat of a Catholic diocese.",
      "It belongs to the Portuguese Healthy Cities Network.",
      "Human occupation of the Viana region dates back to the Mesolithic period, as evidenced by numerous archaeological findings (predating the pre-Roman citadel) on Mount Santa Luzia.",
      "The settlement of Viana received a Charter from King Afonso III of Portugal on July 18, 1258, and became known as Viana da Foz do Lima. Due to the prosperity acquired since then, Viana became an important trading post, and a defensive tower (the Tower of Roqueta) was built to repel pirates from Galicia and North Africa, who sought this port.",
      "The prosperous maritime trade with northern Europe involved the export of wine, fruit, and salt, and the import of cutlery, fabrics, tapestries, and glass. Viana's commercial spirit reached such proportions that Queen Maria II of Portugal granted a charter to the extinct Viana do Castelo Commercial Association in 1852. The same sovereign - to reward the loyalty of the population of Viana, who did not surrender to the forces of the Count of Antas (1847) - decided to elevate the town to city status with the name of Viana do Castelo (January 20, 1848). In the 20th century, it became one of the main Portuguese ports for cod fishing.",
      "The festival cycle in the municipality begins in March with the Festivals of Our Lady of Good News, in Mazarefes. However, its highlight is the traditional 'Pilgrimage in Honor of Our Lady of Agony', which takes place in the middle of summer, around August 20, a public holiday in the municipality.",
      "The Pilgrimage of Agony is linked to the history of the Chapel of Our Lady of Agony. The history of the chapel in honor of the patron saint of fishermen dates back to 1674. At that time, a chapel was built in primitive invocation to the Good Jesus of the Holy Sepulcher of Calvary and, a little above, a small chapel devoted to Our Lady of Conception.",
      "Today, the saint's name is associated with the queen of pilgrimages and the multiple traditions of Portugal's largest popular festival: the pilgrimage in honor of Our Lady of Agony, born in 1772 from the devotion of seafaring men from Galicia and all along the Portuguese coast to the religious and pagan celebrations, which are still repeated annually in the week of August 20, a municipal holiday. The Pilgrimage of Agony received the Declaration of Interest for Tourism in 2013."
    ],
    "pt": [
      "Viana do Castelo é uma cidade portuguesa, capital do distrito com o mesmo nome, na região do Norte, e integrada na sub-região NUT III do Alto Minho, com cerca de 26 000 habitantes (2021).",
      "É sede do município de Viana do Castelo que tem 319,02 km² de área e 85 784 habitantes (2021) estando subdividido em 27 freguesias. O município é limitado a norte pelo município de Caminha, a leste por Ponte de Lima, a sul por Barcelos e Esposende, e a oeste pelo Oceano Atlântico.",
      "O ponto mais alto do município encontra-se na Serra de Arga, mais precisamente no Alto do Espinheiro, a 825 m de altitude.",
      "Pertence à rede das Cidades Cittaslow.",
      "Até à sua elevação a cidade em 20 de janeiro de 1848, a atual Viana do Castelo chamava-se simplesmente 'Viana' (também referida como 'Viana da Foz do Lima' e 'Viana do Minho', para diferenciá-la de Viana do Alentejo). Em 1977, fora elevada a sede de diocese católica.",
      "Pertence à Rede Portuguesa de Cidades Saudáveis.",
      "A ocupação humana da região de Viana remonta ao Mesolítico, conforme o testemunham inúmeros achados arqueológicos (anteriores à cidadela pré-romana) no Monte de Santa Luzia.",
      "A povoação de Viana recebera Carta de Foral de Afonso III de Portugal em 18 de julho de 1258, tendo passado a chamar-se Viana da Foz do Lima. Devido à prosperidade desde então adquirida, Viana tornou-se num importante entreposto comercial, vindo a ser edificada uma torre defensiva (a Torre da Roqueta) com a função de repelir piratas oriundos da Galiza e do Norte de África, os quais procuravam por este porto.",
      "O próspero comércio marítimo com o norte da Europa envolvia a exportação de vinhos, fruta e sal, e a importação de talheres, tecidos, tapeçarias e vidro. O espírito comercial de Viana alcançou tais proporções que a rainha Maria II de Portugal concedera alvará à extinta Associação Comercial de Viana do Castelo em 1852. A mesma soberana — para recompensar a lealdade da população de Viana, que não se rendera às forças do conde das Antas (1847) — decidira elevar a vila à categoria de cidade com o nome de Viana do Castelo (20 de janeiro de 1848). No século XX, tornou-se num dos principais portos portugueses da pesca do bacalhau.",
      "O ciclo de festas no município começa no mês de março, com as Festas de Nossa Senhora das Boas Novas, em Mazarefes. Entretanto, o seu ponto alto é a tradicional 'Romaria em Honra de Nossa Senhora da Agonia', que decorre em pleno Verão, em torno do dia 20 de agosto, feriado no município.",
      "A Romaria d’Agonia junta-se à história da Capela de Nossa Senhora da Agonia. Data de 1674 a história da capela em honra da padroeira dos pescadores. Na altura, foi edificada uma capela em invocação primitiva ao Bom Jesus do Santo Sepulcro do Calvário e, um pouco acima, uma capelinha devota a Nossa Senhora da Conceição.",
      "Hoje, o nome da santa está associado à rainha das romarias e às múltiplas tradições da maior festa popular de Portugal: a romaria em honra de Nossa Senhora da Agonia, nascida em 1772 da devoção dos homens do mar vindos da Galiza e de todo o litoral português para as celebrações religiosas e pagãs, que ainda hoje são repetidas anualmente na semana do dia 20 de agosto, feriado municipal. A Romaria d’Agonia recebeu em 2013 a Declaração de Interesse para o Turismo."
    ]
  },
  "sources": [
    {
      "title": "Wikipedia - Viana do Castelo",
      "path": "https://pt.wikipedia.org/wiki/Viana_do_Castelo"
    }
  ]
}
