[
  {
    "image": "assets/images/torta-viana.webp",
    "name": "Torta de Viana",
    "description": {
      "en": "A delicious traditional Portuguese dessert from Viana do Castelo.",
      "pt": "Uma deliciosa sobremesa tradicional portuguesa de Viana do Castelo."
    },
    "ingredients": {
      "en": [
        "7.5g Baking powder",
        "150g Sugar",
        "180g Wheat flour",
        "9 Eggs",
        "10g Cornstarch",
        "75g Sugar",
        "70ml Water",
        "8 Egg yolks"
      ],
      "pt": [
        "7,5g de Fermento em pó",
        "150 g de Açúcar",
        "180 g de Farinha de trigo",
        "9 ovos",
        "10g de amido de milho",
        "75g de açúcar",
        "70ml de água",
        "8 gemas"
      ]
    },
    "preparation": {
      "en": [
        "Beat the eggs and gradually add the sugar, continuing to beat until a voluminous and whitish cream is obtained.",
        "Add the flour and baking powder, mixing well.",
        "Spread in a rectangular tray previously greased with parchment paper and flour, and bake in a preheated oven at 185ºC for 20-25 minutes.",
        "For the Filling: Mix the sugar with the cornstarch, add the water and egg yolks, mix well.",
        "Bring to a boil until thickened.",
        "Place in a bowl and let it cool.",
        "When the dough is ready, place it on a kitchen towel, and fill the side facing up with the warm cake, and start rolling."
      ],
      "pt": [
        "Bater os ovos e aos poucos adicionar o açúcar, continuando sempre a bater, até que fique um creme volumoso e esbranquiçado.",
        "Acrescentar a farinha e o fermento, envolvendo bem.",
        "Estender num tabuleiro rectangular previamente untado com papel vegetal e farinha e levar ao forno a pré-aquecido a 185ºC durante 20/25min.",
        "Para o Recheio: Misturar o açúcar com a amido de milho, acrescentar a água e a gemas, envolver.",
        "Levar ao lume até engrossar.",
        "Colocar numa tigela e deixar arrefecer.",
        "Quando a massa estiver feita, colocar a mesma sobre um pano de cozinha, e rechear a face virada para cima ainda com o bolo morno, e começar a enrolar."
      ]
    },
    "categories": ["recipes.cake", "recipes.dessert"]
  },
  {
    "image": "assets/images/bacalhau-viana.jpeg",
    "name": "Bacalhau à Moda de Viana",
    "description": {
      "en": "A traditional Portuguese dish from Viana do Castelo, consisting of codfish cooked with cabbage and onions, seasoned with olive oil, salt, and pepper.",
      "pt": "Um prato tradicional português de Viana do Castelo, composto por bacalhau cozido com couve e cebolas, temperado com azeite, sal e pimenta."
    },
    "ingredients": {
      "en": [
        "4 codfish fillets",
        "1 cabbage",
        "6 medium onions",
        "2.5 dl olive oil",
        "Salt and pepper to taste"
      ],
      "pt": [
        "4 postas de bacalhau",
        "1 couve lombarda",
        "6 cebolas médias",
        "2.5dl de azeite",
        "Sal e pimenta q.b."
      ]
    },
    "preparation": {
      "en": [
        "Soak the codfish fillets.",
        "Wash the cabbage leaves in cold water.",
        "Peel and boil potatoes.",
        "Wrap the codfish fillets in cabbage leaves and secure with thick thread to bake in the oven.",
        "While in the oven, slice the onions and brown them in olive oil in a frying pan.",
        "Remove the codfish fillets from the oven when the cabbage leaves are completely dry.",
        "Remove the thread and place on a serving dish, along with the sliced boiled potatoes.",
        "Finally, place the onions on top of the codfish fillets and drizzle with plenty of olive oil.",
        "The most traditional accompaniment is cornbread."
      ],
      "pt": [
        "A preparação começa com a demolha do bacalhau.",
        "Passar folhas de couve por água fria.",
        "Descascar e cozer batatas.",
        "As postas de bacalhau são envolvidas na couve e seguradas com linha grossa, para se levar ao forno.",
        "Enquanto estão no forno, cortam-se as cebolas em rodelas e aloura-se em azeite na frigideira.",
        "As postas são retiradas do forno quando as folhas de couve secarem completamente.",
        "Retira-se depois a linha e coloca-se numa travessa, juntamente com as rodelas de batatas cozidas.",
        "Para finalizar, mete-se a cebola no topo da posta e rega-se com bastante azeite.",
        "O acompanhamento mais tradicional é a broa de milho."
      ]
    },
    "categories": ["recipes.fish"]
  },
  {
    "image": "assets/images/rojoes.jpg",
    "name": "Rojões à Moda do Minho",
    "description": {
      "en": "A traditional dish from the Minho region of Portugal, consisting of pork chunks cooked with various ingredients and spices.",
      "pt": "Um prato tradicional da região do Minho em Portugal, composto por pedaços de carne de porco cozidos com vários ingredientes e especiarias."
    },
    "ingredients": {
      "en": [
        "Approximately 1.3 kg of pork chunks (from the leg of pork)",
        "Lard",
        "Tripe (for frying)",
        "Cooked pig's blood",
        "Pig's liver",
        "Potatoes (for frying)",
        "Lard or oil"
      ],
      "pt": [
        "+/- 1300 kg de rojões (perna de porco) partido aos nacos",
        "Redenho",
        "Tripa enfarinhada",
        "Sangue de porco cozido",
        "Fígado de porco",
        "Batatas para fritar",
        "Banha ou óleo"
      ]
    },
    "preparation": {
      "en": [
        "Start by preparing the marinade. Marinate the pork chunks and lard preferably overnight.",
        "In a spacious pot, place the lard (or oil) to cover the bottom. Strain the marinade and add only the pork chunks, not the lard.",
        "Let it cook slowly, stirring occasionally and adding white wine whenever necessary, but never water.",
        "In a non-stick frying pan, place the lard (without any fat) and fry until golden brown. Once ready, set aside.",
        "Meanwhile, in a pot, place water, season with salt and add 1 bay leaf. Boil the blood along with the liver.",
        "It cooks quickly, so as soon as it's cooked, turn off the heat and keep everything in the pot with the water.",
        "Fry the potatoes cut into cubes and then fry the tripe strips.",
        "After the pork chunks are done, remove the blood and liver (reserving the cooking water to make papas de sarrabulho), chop them into pieces, and add to the pork chunks, along with the fried potatoes, fried tripe, and lard.",
        "Carefully mix everything to blend the flavors.",
        "Serve sprinkled with cumin, garnish with lemon and parsley (or pickles). Serve with dry rice and lettuce salad."
      ],
      "pt": [
        "Comece por preparar a marinada, coloque os rojões e o redenho a marinar de preferência de um dia para o outro.",
        "Num tacho espaçoso coloque a banha (eu coloquei óleo) a cobrir o fundo. Coe a marinada e junte somente os rojões, o redenho não.",
        "Deixe rijar lentamente, mexendo de vez em quando acrescentando vinho branco sempre que necessário e nunca água.",
        "Numa frigideira anti-aderente coloque o redenho sem qualquer gordura (pois vai largar bastante), vá virando e deixe ficar douradinhos. Assim que estiverem prontos reserve.",
        "Entretanto num tacho coloque água, tempere com sal e 1 folha de loureiro e coza o sangue juntamente com o fígado.",
        "Coze rápido, por isso assim que estiver cozido, desligue e mantenha tudo dentro do tacho com a água.",
        "Frite as batatas partidas aos cubos e de seguida frite a tripa enfarinhada partida às tirinhas.",
        "Depois dos rojões prontos, retire o sangue e fígado (reservando a água da cozedura para fazer papas de sarrabulho), parta aos bocados e junte aos rojões, assim como as batatas fritas, a tripa enfarinhada e o redenho.",
        "Envolva tudo com cuidado para se misturarem os sabores.",
        "Sirva polvilhando com cominhos, enfeite com limão e salsa (ou pickles). Acompanhe com arroz seco e salada de alface."
      ]
    },
    "categories": ["recipes.meat"]
  },
  {
    "image": "assets/images/meias-luas.webp",
    "name": "Meias Luas – Doce Conventual Vianense",
    "description": {
      "en": "A traditional Portuguese dessert from Viana do Castelo, known as Half Moons, is a delightful sweet treat enjoyed by many.",
      "pt": "Um doce tradicional português de Viana do Castelo, conhecido como Meias Luas, é uma deliciosa guloseima apreciada por muitos."
    },
    "ingredients": {
      "en": [
        "300g Flour (approximately)",
        "75g Butter (approximately)",
        "2 dl Water",
        "Salt and butter for frying",
        "300g Sugar (approximately)",
        "75g Almonds (approximately)",
        "50g Cassava flour",
        "6 to 7 Egg yolks"
      ],
      "pt": [
        "300g de Farinha (aproximadamente)",
        "75g de Manteiga (aproximadamente)",
        "2 dl de Água",
        "Sal e manteiga para fritar",
        "300g de Açúcar (aproximadamente)",
        "75g de Amêndoas (aproximadamente)",
        "50g de Farinha de pau (mandioca)",
        "6 a 7 Gemas de ovo"
      ]
    },
    "preparation": {
      "en": [
        "On a countertop, sift the flour into a pile, making a well in the center. In this well, add the butter.",
        "Mix the flour with the butter and add the necessary water until well combined.",
        "Roll into a log and slice into rounds.",
        "With the help of a rolling pin, roll out the dough and cut with a pastry wheel, forming the Half Moons.",
        "Once ready, fry in butter.",
        "When cool, sprinkle with powdered sugar."
      ],
      "pt": [
        "Num balcão, peneire a farinha formando um monte, fazendo um buraco no centro. Neste buraco, adicione a manteiga.",
        "Misture a farinha com a manteiga e adicione a água necessária até ficar bem trabalhada.",
        "Enrole em um cilindro e corte em fatias.",
        "Com a ajuda de um rolo, estenda a massa e corte com uma carretilha, formando as Meias Luas.",
        "Depois de prontas, frite em manteiga.",
        "Quando frias, polvilhe com açúcar em pó."
      ]
    },
    "categories": ["recipes.dessert"]
  },
  {
    "image": "assets/images/pescada-vianense.webp",
    "name": "Pescada à Vianense",
    "description": {
      "en": "A delicious seafood dish, Pescada à Vianense is a traditional recipe from Viana do Castelo, featuring codfish medallions baked with potatoes, onions, and a flavorful blend of seasonings.",
      "pt": "Um delicioso prato de frutos do mar, a Pescada à Vianense é uma receita tradicional de Viana do Castelo, apresentando medalhões de pescada assados com batatas, cebolas e uma mistura saborosa de temperos."
    },
    "ingredients": {
      "en": [
        "Codfish Medallions",
        "Potatoes",
        "Onions",
        "Olive Oil",
        "Garlic",
        "Salt, lemon to taste",
        "Mayonnaise"
      ],
      "pt": [
        "Medalhões de Pescada",
        "Batatas",
        "Cebolas",
        "Azeite",
        "Alho",
        "Sal, limão q.b.",
        "Maionese"
      ]
    },
    "preparation": {
      "en": [
        "The day before, season the codfish medallions with salt, lemon juice, and garlic.",
        "On the day, drizzle the bottom of a baking dish with olive oil and place the sliced ​​potatoes.",
        "Meanwhile, make a sauté with olive oil, plenty of onion, and garlic, which is placed on top of the potatoes.",
        "Place the codfish medallions on top.",
        "Spread with mayonnaise and bake in a preheated oven at 180°C."
      ],
      "pt": [
        "No dia anterior, tempere os medalhões de pescada com sal, sumo de limão e alho.",
        "No dia, regue o fundo de uma assadeira com azeite e coloque as batatas cortadas em rodelas.",
        "Entretanto, faça um refogado com azeite, bastante cebola e alho que se coloca por cima das batatas.",
        "Disponha os medalhões de pescada por cima.",
        "Barrar com maionese e levar ao forno pré-aquecido a 180°C."
      ]
    },
    "categories": ["recipes.seafood"]
  },
  {
    "image": "assets/images/formigos-minho.webp",
    "name": "Formigos à Moda do Minho",
    "description": {
      "en": "Formigos à Moda do Minho is a traditional Portuguese dessert, particularly popular in the Minho region. Made with bread, honey, sugar, and spices, it's a rich and comforting treat enjoyed during festive occasions.",
      "pt": "Os Formigos à Moda do Minho são uma sobremesa tradicional portuguesa, especialmente popular na região do Minho. Feitos com pão, mel, açúcar e especiarias, são uma guloseima rica e reconfortante apreciada durante ocasiões festivas."
    },
    "ingredients": {
      "en": [
        "2.5 dl Water",
        "2 tablespoons Honey",
        "250 g Sugar",
        "2 Cinnamon sticks",
        "3 Lemon peels (tied with a string to the cinnamon sticks)",
        "6 or 7 Small bread rolls",
        "50 g Butter",
        "3 Eggs",
        "1 Glass of Port wine",
        "A pinch of salt, walnuts, pine nuts, raisins, cinnamon powder for sprinkling"
      ],
      "pt": [
        "2,5 dl de Água",
        "2 colheres (de sopa) de Mel",
        "250 g de Açúcar",
        "2 Paus de canela",
        "3 Casquinhas de limão (atadas com um fio aos paus de canela)",
        "6 ou 7 Pãezinhos",
        "50 g de Manteiga",
        "3 Ovos",
        "1 Cálice de Vinho do Porto",
        "1 Pitada de sal, nozes, pinhões, uvas passas, canela em pó para polvilhar"
      ]
    },
    "preparation": {
      "en": [
        "Break the bread into very small pieces. Then, pour water into a saucepan with the cinnamon and lemon peel and a pinch of salt, bring to a boil, about 10 minutes.",
        "Remove the cinnamon and lemon, add the bread and butter, stirring with a wooden spoon to break it up well; let it boil for 5 minutes.",
        "Then add the honey and sugar, continue stirring to prevent sticking, letting it boil for a few more minutes (about 5).",
        "Beat the egg yolks in a bowl, together with the Port wine and pour into the formigos. Add the nuts, pine nuts, and raisins, mix everything very well and bring to the heat.",
        "Let it boil for 3 minutes, remove from the heat and fill the serving dishes. Let it cool and sprinkle with cinnamon, serve cold."
      ],
      "pt": [
        "Parta o pão em pedaços muito pequeninos. Deite depois num tacho a água com a canela e a casca de limão e uma pitada de sal, leve ao lume até que ferva, cerca de 10 minutos.",
        "Retire a canela e o limão, junte o pão e a manteiga, mexendo com uma colher de pau para se desfazer bem; deixe ferver durante 5 minutos.",
        "Junte depois o mel e o açúcar, continue a mexer para não pegar, deixando ferver mais uns minutos (cerca de 5).",
        "Bata as gemas numa malga, juntamente com o vinho do Porto e deite nos formigos. Junte as nozes, os pinhões e as uvas passas, mexa tudo muito bem e leve ao lume.",
        "Deixe ferver 3 minutos, retire do lume e encha as travessas. Deixe arrefecer e polvilhe com a canela, comem-se frios."
      ]
    },
    "categories": ["recipes.dessert"]
  }
]
